Autodesk.Revit.DB.TextAlignMask
An enumerated type listing all the Text align mask.

Autodesk.Revit.DB.TextAlignMask.vertAlignMask
The mask of the Text object being aligned in the vertical direction.

Autodesk.Revit.DB.TextAlignMask.horzAlignMask
The mask of the Text object being aligned in the horizontal direction.